Documents/ОказаниеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ОказаниеУслуги</Name>
			<BasedOn>
				<xr:Item>Catalog.Клиенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СтоимостьМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОказаниеУслуги/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера (СтандартнаяОбработка, Префикс)
	
	Префикс = Обмен.ПолучитьПрефиксНомера();
	
КонецПроцедуры

	
	
	
Процедура ОбработкаПроведения(Отказ, Режим)
		
		
		
		Движения.ОстаткиМатериалов.Записывать = Истина;
		
		Движения.СтоимостьМатериалов.Записывать = Истина;
		
		Движения.Продажи.Записывать = Истина;
		
		
		
		// Создать менеджер временных таблиц
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		
		
		#Область НоменклатураДокумента
		
		Запрос = Новый Запрос;
		
		
		
		// Укажем, какой менеджер временных таблиц использует этот запрос
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		
		
		
		Запрос.Текст =
		
		"ВЫБРАТЬ
		
		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		
		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		
		|        СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
		
		|        СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе
		
		|ПОМЕСТИТЬ НоменклатураДокумента
		
		|ИЗ
		
		|        Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
		
		|ГДЕ
		
		|        ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
		
		|
		
		|СГРУППИРОВАТЬ ПО
		
		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		
		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры";
		
		
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		#КонецОбласти
		
		
		
		#Область ДвиженияДокумента
		
		Запрос2 = Новый Запрос;
		
		Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
		
		Запрос2.Текст = "ВЫБРАТЬ
		
		|        НоменклатураДокумента.Номенклатура,
		
		|        НоменклатураДокумента.ВидНоменклатуры,
		
		|        НоменклатураДокумента.КоличествоВДокументе,
		
		|        НоменклатураДокумента.СуммаВДокументе,
		
		|        ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость,
		
		|        ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество
		
		|ИЗ
		
		|        НоменклатураДокумента КАК НоменклатураДокумента
		
		|                ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки( , Материал В
		
		|                         (ВЫБРАТЬ
		
		|                                 НоменклатураДокумента.Номенклатура
		
		|                         ИЗ
		
		|                                 НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
		
		|                ПО НоменклатураДокумента.Номенклатура = СтоимостьМатериаловОстатки.Материал
		
		|                ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки( , Материал В
		
		|                         (ВЫБРАТЬ
		
		|                                 НоменклатураДокумента.Номенклатура
		
		|                         ИЗ
		
		|                                 НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
		
		|                ПО НоменклатураДокумента.Номенклатура = ОстаткиМатериаловОстатки.Материал";
		
		
		
		// Установим необходимость блокировки данных в регистрах СтоимостьМатериалов и ОстаткиМатериалов
		
		Движения.СтоимостьМатериалов.БлокироватьДляИзменения = Истина;
		
		Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;
		
		
		
		// Запишем пустые наборы записей, чтобы читать остатки без учета данных в документе
		
		Движения.СтоимостьМатериалов.Записать();
		
		Движения.ОстаткиМатериалов.Записать();
		
		
		
		РезультатЗапроса = Запрос2.Выполнить();
		
		
		
		// ТЗ = РезультатЗапроса.Выгрузить();
		
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда
				
				СтоимостьМатериала = 0;
				
				
				
			Иначе
				
				СтоимостьМатериала = ВыборкаДетальныеЗаписи.Стоимость / ВыборкаДетальныеЗаписи.Количество;
				
				
				
			КонецЕсли;
			
			
			
			Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Материал Тогда
				
				
				
				// Регистр ОстаткиМатериалов Расход
				
				Движение = Движения.ОстаткиМатериалов.Добавить();
				
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				
				Движение.Период = Дата;
				
				Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
				
				Движение.Склад = Склад;
				
				Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
				
				
				
				// Регистр СтоимостьМатериалов Расход
				
				Движение = Движения.СтоимостьМатериалов.Добавить();
				
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				
				Движение.Период = Дата;
				
				Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
				
				Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе * СтоимостьМатериала;
				
				
				
			КонецЕсли;
			
			
			
			// Регистр Продажи
			
			Движение = Движения.Продажи.Добавить();
			
			Движение.Период = Дата;
			
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			
			Движение.Клиент = Клиент;
			
			Движение.Мастер = Мастер;
			
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			
			Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
			
			Движение.Стоимость = СтоимостьМатериала * ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			
			
			
		КонецЦикла;
		
		
		
		Движения.Записать();
		
		#КонецОбласти
		
		
		
		#Область КонтрольОстатков
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			
			
			
			// Проверить отрицательные остатки
			
			Запрос3 = Новый Запрос;
			
			Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
			
			Запрос3.Текст = "ВЫБРАТЬ
			                |	ОстаткиМатериаловОстатки.Материал КАК Материал,
			                |	ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
			                |ИЗ
			                |	РегистрНакопления.ОстаткиМатериалов.Остатки(
			                |			,
			                |			Материал В
			                |					(ВЫБРАТЬ
			                |						НоменклатураДокумента.Номенклатура
			                |					ИЗ
			                |						НоменклатураДокумента)
			                |				И Склад = &Склад) КАК ОстаткиМатериаловОстатки
			                |ГДЕ
			                |	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
			
			
			
			Запрос3.УстановитьПараметр("Склад", Склад);
			
			
			
			РезультатЗапроса = Запрос3.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю();
				
				Сообщение.Текст = "Не хватает " + Строка(- ВыборкаДетальныеЗаписи.КоличествоОстаток) + " единиц материала """ + ВыборкаДетальныеЗаписи.Материал + """";
				
				Сообщение.Сообщить();
				
				
				
				Отказ = Истина;
				
				
				
			КонецЦикла;
			
			
			
		КонецЕсли;
		
		#КонецОбласти
		
		
		
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	//Движения.ОстаткиМатериалов.Записывать = Истина;
	//Движения.СтоимостьМатериалов.Записывать = Истина;
	//Движения.Продажи.Записывать = Истина; 
	//Движения.Управленческий.Записывать = Истина;
	//МенеджерВТ = Новый МенеджерВременныхТаблиц;
	//#Область НоменклатураДокумента	
	//Запрос = Новый Запрос; 
	//Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	//Запрос.Текст =  
	// 	"ВЫБРАТЬ
	// 	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура КАК Номенклатура,
	// 	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	// 	|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств КАК НаборСвойств,
	// 	|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
	// 	|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе
	// 	|ПОМЕСТИТЬ НоменклатураДокумента
	// 	|ИЗ
	// 	|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
	// 	|ГДЕ
	// 	|	ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
	// 	|
	// 	|СГРУППИРОВАТЬ ПО
	// 	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
	// 	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры,
	// 	|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств";
	//		
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//#КонецОбласти
	//#Область ДвижениеДокумента
	//Запрос2 = Новый Запрос;
	//Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	//Запрос2.Текст = "ВЫБРАТЬ
	//                |	НоменклатураДокумента.Номенклатура КАК Номенклатура,
	//                |	НоменклатураДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	//                |	НоменклатураДокумента.НаборСвойств КАК НаборСвойств,
	//                |	НоменклатураДокумента.КоличествоВДокументе КАК КоличествоВДокументе,
	//                |	НоменклатураДокумента.СуммаВДокументе КАК СуммаВДокументе,
	//                |	ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость,
	//                |	ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество
	//                |ИЗ
	//                |	НоменклатураДокумента КАК НоменклатураДокумента
	//                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки(
	//                |				,
	//                |				Материал В
	//                |					(ВЫБРАТЬ
	//                |						НоменклатураДокумента.Номенклатура
	//                |					ИЗ
	//                |						НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
	//                |		ПО НоменклатураДокумента.Номенклатура = СтоимостьМатериаловОстатки.Материал
	//                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(
	//                |				,
	//                |				Материал В
	//                |					(ВЫБРАТЬ
	//                |						НоменклатураДокумента.Номенклатура
	//                |					ИЗ
	//                |						НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
	//                |		ПО НоменклатураДокумента.Номенклатура = ОстаткиМатериаловОстатки.Материал";
	//    Движения.СтоимостьМатериалов.БлокироватьДляИзменения = Истина;
	//	Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;
	//    Движения.СтоимостьМатериалов.Записать();
	//	Движения.ОстаткиМатериалов.Записать();
	//	РезультатЗапроса = Запрос2.Выполнить(); 
	//	//ТЗ = РезультатЗапроса.Выгрузить();
	//    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда
	//	СтоимостьМатериала = 0;
	//Иначе
	//	СтоимостьМатериала = ВыборкаДетальныеЗаписи.Стоимость / ВыборкаДетальныеЗаписи.Количество;
	//КонецЕсли;

	//Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Материал Тогда
	//	//Регистр ОстаткиМатериалов Расход
	//	Движение = Движения.ОстаткиМатериалов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
	//	Движение.НаборСвойств = ВыборкаДетальныеЗаписи.НаборСвойств;
	//	Движение.Склад = Склад;
	//	Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
	//    //Регистр СтоимостьМатериалов Расход
	//	Движение = Движения.СтоимостьМатериалов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
	//	Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе * СтоимостьМатериала;
	//	// Регистр Управленческий
	//	// Первая проводка: Д 62(ДебиторскаяЗадолжность) - К
	//	// 90 (Капитал) Розничная сумма
	//	Движение = Движения.Управленческий.Добавить();
	//	Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолжнсть;
	//	Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	//	Движение.Период = Дата;
	//	Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаВДокументе;
	//	Движение.СубКонтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;   
	//	
	//	//Вторая проводка: Д 90 (Капитал) - К 41 (Товары) - себестоимость
	//	
	//	Движение = Движения.Управленческий.Добавить();
	//	Движение.СчетДт = ПланыСчетов.Основной.Капитал;
	//	Движение.СчетКт = ПланыСчетов.Основной.Товары;
	//	Движение.Период = Дата;
	//	Движение.Сумма = СтоимостьМатериала * ВыборкаДетальныеЗаписи.КоличествоВДокументе;
	//	Движение.КоличествоКт = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
	//	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ВыборкаДетальныеЗаписи.Номенклатура;
	//	
	//КонецЕсли;
	//	Движение = Движения.Продажи.Добавить();
	//	Движение.Период = Дата;
	//	Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
	//	Движение.Клиент = Клиент;
	//	Движение.Мастер = Мастер;
	//	Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
	//	Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
	//	Движение.Стоимость = СтоимостьМатериала * ВыборкаДетальныеЗаписи.КоличествоВДокументе;
	// КонецЦикла;
	//
	//	 Движения.Записать();
	//	 #КонецОбласти
	//#Область ОстаткиНоменклатуры	 
	//	 Если Режим = РежимПроведенияДокумента.Оперативный Тогда
	//	
	//КонецЕсли; 
	//	 Запрос3 = Новый Запрос;
	//	 Запрос3.МенеджерВременныхТаблиц = МенеджерВТ; 
	//	 Запрос3.Текст = "ВЫБРАТЬ
	//	                 |	ОстаткиМатериаловОстатки.Материал КАК Материал,
	//	                 |	ОстаткиМатериаловОстатки.НаборСвойств КАК НаборСвойств,
	//	                 |	ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
	//	                 |ИЗ
	//	                 |	РегистрНакопления.ОстаткиМатериалов.Остатки(
	//	                 |			,
	//	                 |			(Материал, НаборСвойств) В
	//	                 |					(ВЫБРАТЬ
	//	                 |						НоменклатураДокумента.Номенклатура,
	//	                 |						НоменклатураДокумента.НаборСвойств
	//	                 |					ИЗ
	//	                 |						НоменклатураДокумента)
	//	                 |				И Склад = &Склад) КАК ОстаткиМатериаловОстатки
	//	                 |ГДЕ
	//	                 |	ОстаткиМатериаловОстатки.КоличествоОстаток < 0"; 

	//Запрос3.УстановитьПараметр("Склад", Склад);
	//РезультатЗапроса = Запрос3.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//Сообщение = Новый СообщениеПользователю();
	//Сообщение.Текст = "Не хватает " + Строка(- ВыборкаДетальныеЗаписи.КоличествоОстаток) + " единиц материала """ + ВыборкаДетальныеЗаписи.Материал + """" +" из набора свойств """ + ВыборкаДетальныеЗаписи.НаборСвойств + """";
	//Сообщение.Сообщить();
	//Отказ = Истина;
	//КонецЦикла;
	//#КонецОбласти
		
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
#Область Черновик   
//   Процедура ОбработкаПроведения(Отказ, Режим)
//		Движения.ОстаткиМатериалов.Записывать = Истина;
//		Движения.СтоимостьМатериалов.Записывать = Истина;
//		Движения.Продажи.Записывать = Истина;
//		МенеджерВТ = Новый МенеджерВременныхТаблиц;
//	#Область НоменклатураДокумента	
//	Запрос = Новый Запрос; 
//	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
//	Запрос.Текст =  
//     	"ВЫБРАТЬ
//  		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
//		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
//		|        ОказаниеУслугиПереченьНоменклатуры.НаборСвойств,
//		|        СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
//		|        СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе
//		|ПОМЕСТИТЬ НоменклатураДокумента
//		|ИЗ
//		|        Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
//		|ГДЕ
//		|        ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
//		|СГРУППИРОВАТЬ ПО
//		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
//		|        ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры,
//		|        ОказаниеУслугиПереченьНоменклатуры.НаборСвойств";
//		//"ВЫБРАТЬ
//		//|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура КАК Номенклатура,
//		//|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
//		//|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
//		//|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе,
//		//|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств КАК НаборСвойств
//		//|ПОМЕСТИТЬ НоменклатураДокумента
//		//|ИЗ
//		//|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
//		//|ГДЕ
//		//|	ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
//		//|
//		//|СГРУППИРОВАТЬ ПО
//		//|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
//		//|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры,
//		//|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств";
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	РезультатЗапроса = Запрос.Выполнить();
//	#КонецОбласти
//	#Область ДвижениеДокумента
//	Запрос2 = Новый Запрос;
//	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
//	Запрос2.Текст = "ВЫБРАТЬ
//		//|	     НоменклатураДокумента.Номенклатура,
//		//|        НоменклатураДокумента.ВидНоменклатуры, 
//		//|        НоменклатураДокумента.НаборСвойств,
//		//|        НоменклатураДокумента.КоличествоВДокументе,
//		//|        НоменклатураДокумента.СуммаВДокументе,
//		//|        ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость,
//		//|        ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество
//		//|ИЗ
//		//|        НоменклатураДокумента КАК НоменклатураДокумента 
//		|		 НоменклатураДокумента.Номенклатура,
//		|        НоменклатураДокумента.ВидНоменклатуры,
//		|        НоменклатураДокумента.НаборСвойств,
//		|        НоменклатураДокумента.КоличествоВДокументе,
//		|        НоменклатураДокумента.СуммаВДокументе,
//		|        ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость,
//		|        ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество
//		|ИЗ
//		|        НоменклатураДокумента КАК НоменклатураДокумента
//		|                ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки( , Материал В (
//		|                         ВЫБРАТЬ
//		|                                  НоменклатураДокумента.Номенклатура
//		|                         ИЗ
//		|                                  НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
//		|                ПО НоменклатураДокумента.Номенклатура = СтоимостьМатериаловОстатки.Материал
//		|                ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки( , Материал В (
//		|                         ВЫБРАТЬ
//		|                                  НоменклатураДокумента.Номенклатура
//		|                         ИЗ
//		|                                  НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
//		|                ПО НоменклатураДокумента.Номенклатура = ОстаткиМатериаловОстатки.Материал";
//	    Движения.СтоимостьМатериалов.БлокироватьДляИзменения = Истина;
//		Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;
//	    Движения.СтоимостьМатериалов.Записать();
//    	Движения.ОстаткиМатериалов.Записать();
//		РезультатЗапроса = Запрос2.Выполнить(); 
//		//ТЗ = РезультатЗапроса.Выгрузить();
//        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//	Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда
//		СтоимостьМатериала = 0;
//	Иначе
//		СтоимостьМатериала = ВыборкаДетальныеЗаписи.Стоимость / ВыборкаДетальныеЗаписи.Количество;
//	КонецЕсли;

//	Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Материал Тогда
//		Движение = Движения.ОстаткиМатериалов.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//		Движение.Период = Дата;
//		Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
//		Движение.НаборСвойств = ВыборкаДетальныеЗаписи.НаборСвойств;
//		Движение.Склад = Склад;
//		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;

//		Движение = Движения.СтоимостьМатериалов.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//		Движение.Период = Дата;
//		Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
//		Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе * СтоимостьМатериала;

//	КонецЕсли;
//		Движение = Движения.Продажи.Добавить();
//		Движение.Период = Дата;
//		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
//		Движение.Клиент = Клиент;
//		Движение.Мастер = Мастер;
//		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
//		Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
//		Движение.Стоимость = СтоимостьМатериала * ВыборкаДетальныеЗаписи.КоличествоВДокументе;
//     КонецЦикла;
//	
//		 Движения.Записать();
//		 #КонецОбласти
//	#Область ОстаткиНоменклатуры	 
//		 Если Режим = РежимПроведенияДокумента.Оперативный Тогда
//		
//	КонецЕсли; 
//		 Запрос3 = Новый Запрос;
//		 Запрос3.МенеджерВременныхТаблиц = МенеджерВТ; 
//		 Запрос3.Текст = "ВЫБРАТЬ
//|        ОстаткиМатериаловОстатки.Материал,
//|        ОстаткиМатериаловОстатки.НаборСвойств,
//|        ОстаткиМатериаловОстатки.КоличествоОстаток
//|ИЗ
//|        РегистрНакопления.ОстаткиМатериалов.Остатки( , (Материал, НаборСвойств) В
//|                (ВЫБРАТЬ
//|                         НоменклатураДокумента.Номенклатура,
//|                         НоменклатураДокумента.НаборСвойств
//|                ИЗ
//|                         НоменклатураДокумента) И Склад = &Склад)
//|        КАК ОстаткиМатериаловОстатки
//|ГДЕ
//|        ОстаткиМатериаловОстатки.КоличествоОстаток < 0 "; 

//Запрос3.УстановитьПараметр("Склад", Склад);
//РезультатЗапроса = Запрос3.Выполнить();
//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//Сообщение = Новый СообщениеПользователю();
//Сообщение.Текст = "Не хватает " + Строка(- ВыборкаДетальныеЗаписи.КоличествоОстаток) + " единиц материала """ + ВыборкаДетальныеЗаписи.Материал + """" +" из набора свойств """ + ВыборкаДетальныеЗаписи.НаборСвойств + """";
//Сообщение.Сообщить();
//Отказ = Истина;
//КонецЦикла;
//		// Запрос3.Текст = "ВЫБРАТЬ
//		// |	ОстаткиМатериаловОстатки.Материал КАК Материал,
//		// |  ОстаткиМатериаловОстатки.НаборСвойств,
//		// |	ОстаткиМатериаловОстатки.КоличествоОстаток КАК Количество
//		// |ИЗ
//		// |	РегистрНакопления.ОстаткиМатериалов.Остатки(,
//		// |	(Материал, НаборСвойств) В		
//		// |			        (ВЫБРАТЬ
//		// |					        НоменклатураДокумента.Номенклатура,
//		// |						    НоменклатураДокумента.НаборСвойств
//		// |					ИЗ
//		// |						НоменклатураДокумента)
//		// |				И Склад = &Склад) КАК ОстаткиМатериаловОстатки
//		// |ГДЕ
//		// |	ОстаткиМатериаловОстатки.КоличествоОстаток < 0"; 
//		// Запрос3.УстановитьПараметр("Склад", Склад);
//		// РезультатЗапроса = Запрос3.Выполнить();
//		// ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//		// 
//		//Пока ВыборкаДетальныеЗаписи.Следующий()Цикл
//		//	 Сообщение = Новый СообщениеПользователю();
//		//	 Сообщение.Текст = "Не хватает" + Строка(- ВыборкаДетальныеЗаписи.Количество) + "единиц материала """ + ВыборкаДетальныеЗаписи.Материал + """" + " из набора свойств """ + ВыборкаДетальныеЗаписи.НаборСвойств + """";
//		//	 Сообщение.Сообщить();
//		//	 Отказ = Истина;
//		//КонецЦикла;
//       #КонецОбласти
//	
//   КонецПроцедуры    
#КонецОбласти
